I was not able to reproduce with the latest version of provider: `1.3.0.`.

```bash
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # maas_vm_host.infra1 will be created
  + resource "maas_vm_host" "infra1" {
      + cpu_over_commit_ratio         = (known after apply)
      + default_macvlan_mode          = (known after apply)
      + id                            = (known after apply)
      + memory_over_commit_ratio      = (known after apply)
      + name                          = "infra1"
      + pool                          = (known after apply)
      + power_address                 = "qemu+ssh://maas@10.244.40.30/system"
      + resources_cores_total         = (known after apply)
      + resources_local_storage_total = (known after apply)
      + resources_memory_total        = (known after apply)
      + tags                          = [
          + "kvm",
          + "pod-console-logging",
          + "virtual",
        ]
      + type                          = "virsh"
      + zone                          = "default"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

maas_vm_host.infra1: Creating...
maas_vm_host.infra1: Creation complete after 4s [id=6]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

$ terraform state show maas_vm_host.infra1
# maas_vm_host.infra1:
resource "maas_vm_host" "infra1" {
    cpu_over_commit_ratio         = 1
    id                            = "6"
    memory_over_commit_ratio      = 1
    name                          = "infra1"
    pool                          = "default"
    power_address                 = "qemu+ssh://maas@10.244.40.30/system"
    resources_cores_total         = 0
    resources_local_storage_total = 0
    resources_memory_total        = 0
    tags                          = [
        "kvm",
        "pod-console-logging",
        "virtual",
    ]
    type                          = "virsh"
    zone                          = "default"
}

$ terraform destroy
maas_vm_host.infra1: Refreshing state... [id=6]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # maas_vm_host.infra1 will be destroyed
  - resource "maas_vm_host" "infra1" {
      - cpu_over_commit_ratio         = 1 -> null
      - id                            = "6" -> null
      - memory_over_commit_ratio      = 1 -> null
      - name                          = "infra1" -> null
      - pool                          = "default" -> null
      - power_address                 = "qemu+ssh://maas@10.244.40.30/system" -> null
      - resources_cores_total         = 0 -> null
      - resources_local_storage_total = 0 -> null
      - resources_memory_total        = 0 -> null
      - tags                          = [
          - "kvm",
          - "pod-console-logging",
          - "virtual",
        ] -> null
      - type                          = "virsh" -> null
      - zone                          = "default" -> null
    }

Plan: 0 to add, 0 to change, 1 to destroy.

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

maas_vm_host.infra1: Destroying... [id=6]
maas_vm_host.infra1: Destruction complete after 0s

Destroy complete! Resources: 1 destroyed.

```